const EP = [
  {
    nameGroup: "Смоляное чучелко",
    nameAlbum: "Смоляное чучелко",
    get fullName() {
      // геттер
      return `${this.nameGroup} — ${this.nameAlbum}`;
    },
    buttons: [
      {
        itunes: `https://geo.music.apple.com/us/album/
				%D1%81%D0%BC%D0%BE%D0%BB%D1%8F%D0%BD%D0%BE%D0%B5-%D1%87%D1%83%D1%87%D0%B5%D0%BB%D0%BA%D0%BE-ep/
				1509238927?uo&amp;mt=1&amp;app=itunes&amp;at=1000l9WJ&amp;ct=bq`,
        bandcamp: "https://smolyanoechuchelko.bandcamp.com/album/-",
        amazon: `https://music.amazon.com/albums/
				B087PL1TBW?ref=dm_sh_456e-3972-dmcp-d2c6-ea06d&amp;
				musicTerritory=US&amp;marketplaceId=ATVPDKIKX0DER`,
        apple: `https://geo.music.apple.com/us/album/
				%D1%81%D0%BC%D0%BE%D0%BB%D1%8F%D0%BD%D0%BE%D0%B5-%D1%87%D1%83%D1%87%D0%B5%D0%BB%D0%BA%D0%BE-ep/
				1509238927?uo&amp;mt=1&amp;app=music&amp;at=1000l9WJ&amp;ct=bq`,
        vk: "https://vk.com/music/album/-2000269477_7269477_bba1bfe909be511c07?act=album",
        youtube:
          "https://music.youtube.com/playlist?list=OLAK5uy_luccgS_47OsZN8YlvJPNTsZgTRDdReSOk",
        spotify: "https://open.spotify.com/album/6vr5jlUpTMT2rmTlsThZxc",
        yandex: "https://music.yandex.ru/album/10541546",
        deezer: "https://www.deezer.com/ru/album/143471132",
        tidal: "https://listen.tidal.com/album/138320502",
      },
    ],
    release: [
      {
        date: "2020-04-16",
        UPC: "195079279966",
        design: "Дизайн",
        designer: "Blexbolex",
        designerURL: "https://en.wikipedia.org/wiki/Blexbolex",
      },
    ],
    detales: [
      {
        id: 0,
        title: "Жанр",
        content: ["Гранж, альтернативный рок."],
      },
      {
        id: 1,
        title: "Запись",
        content: [
          "16 октября—28 декабря 2018 (Музыкальная Академия Матвиенко М.А.М.А, Москва).",
          "2 ноября 2018 (Продюсерский центр Алексея Мускатина, Москва).",
          "4 октября 2019 (Студия Космос, Москва).",
          "9 октября 2019—14 декабря 2019 (495 Studio Records, Москва).",
        ],
      },
      {
        id: 2,
        title: "Сведение",
        content: ["15 декабря 2019—2 марта 2020 (DTH Studios, Москва)."],
      },
      {
        id: 3,
        title: "Мастеринг",
        content: [
          "31 марта 2020—10 апреля 2020 (Chicago Mastering Service, Chicago, USA).",
        ],
      },
      {
        id: 4,
        title: "Исполнители",
        content: [
          "Ярослав Жук — гитара, вокал, бэк-вокал, слова и музыка.",
          "Семён Лепёшкин — бас-гитара.",
        ],
      },
      {
        id: 5,
        title: "Сессионные музыканты",
        content: [
          "Алексей Еживич — ударные.",
          "Наталья Хмелёвская — виолончель («Водянистая влага»).",
        ],
      },
      {
        id: 6,
        title: "Продюсирование",
        content: [
          "Ярослав Жук — продюсер.",
          "Илья Лукашев — звукоинженер.",
          "Юрий Катешев — звукоинженер (запись виолончели).",
          "Антон Артисюк — звукоинженер (запись акустической гитары).",
          "Александр Колесников — звукоинженер (запись вокала).",
          "Илья Marvel Горохводатский — сведение.",
          "Mettew J Barnhart — мастеринг.",
        ],
      },
      {
        id: 7,
        title: "Эта запись была бы невозможна без:",
        content: [
          "Галина Жук, Аркадий Жук, Кристина Шпак, Сергей Рябов, Илья Быков, Антон Сапфиров, Стив Альбини, Курт Кобейн.",
        ],
      },
    ],
    tracks: [
      {
        id: 0,
        title: "Последний поршневый бомбардировщик",
        content: `
Выбери шоу
Выбери пол
Выбери хлор
И беконовый ролл

Бей в барабан
Цирк обезьян
Смех на заказ
Ещё раз

Сон,
Удалённый тошнотой
Интерферон,
Зовущий рой
Дырка в клею
Солдатских жвал
Кости за борт — я завязал

Выбери панк
Выбери джанк
Чёрный укол
И осиновый кол

Пей дуракол
Лай и играй
Брюхо вспорол
Мой парный сай

Сон,
Удалённый тошнотой
Интерферон,
Зовущий рой
Дырка в клею
Солдатских жвал
Кости за борт — я завязал

Сон,
Удалённый тошнотой
Интерферон,
Зовущий рой
Дырка в клею
Солдатских жвал
Кости за борт — я завязал`,
        duration: 2,
      },
      {
        id: 1,
        title: "Водянистая влага",
        content: `
Я с твоим лицом
За твоим лицом
Год из года ждёт
Твой невидимый рот

Семь серийных фаз
Семь серийных фаз
Семи мёртвых глаз

Семь серийных фаз
Семь серийных фаз
Семя мёртвых глаз

Слышит голоса
Он устал от снов
Звон золотой трубы
Семи городов

Семь серийных фаз
Семь серийных фаз
Семи мёртвых глаз

Семь серийных фаз
Семь серийных фаз
Семя мёртвых глаз

Я с твоим лицом
За твоим лицом
Год из года ждёт
Твой невидимый рот

Твой рот
Твой рот
Твой рот
Твой рот
Твой рот
Твой рот`,
        duration: 3.2,
      },
      {
        id: 2,
        title: "Рулевой мёртв",
        content: `
Акрил, зараза и пот
Скошенный рот
О, будь рад

Создай голый типаж
Свой персонаж
О, будь рад

Твой дом —
Огороженный мрак
Каменный флаг
О, будь рад

Ты здесь
Чтобы выпить меня
Сторнируй себя

Сад червей
Чад свиней
Крестный ход
В дымоход

Иблис змей
Пост слюной
С атрицей
На покой

Баржа и общий котёл
За ноздрю на прикол
О, будь рад

Маржа, финансовый вклад
Гербарий и морс
О, будь рад

Промозгл
Рефлексирующий мозг
Обезвоженный торс
О, будь рад

Дождись гурий и мёд
Мускусный пот

Сад червей
Чад свиней
Крестный ход
В дымоход

Иблис змей
Пост слюной
С атрицей
На покой

Мёртв рулевой
В дыму баркас 
Не в этот раз
Не в этот раз

Мёртв рулевой
В дыму баркас 
Не в этот раз
Не в этот раз`,
        duration: 3.2,
      },
      {
        id: 3,
        title: "Бром и сталь",
        content: `
Стань безопасным
Штамп с прозрачной плотью
Лингам бесполезный
Друг стальной оскал мой

О, дали бром
Дали пить и дышать мне
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь

Сдерживай себя
До боли в груди
Кожа на руках
Склеилась от пота
Ври

Каждый без ума
От самого себя
Липкая рука
Крутит грязный кусок
Стали

Бромная вода
Хромистая сталь
Железы-глаза 
Тратишь понапрасну

Алкил нитриты
Биение сердца
Мёртвые пятна
На моей сетчатке

О, дали бром
Дали пить и дышать мне
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь
Бром и сталь

Сдерживай себя
До боли в груди
Кожа на руках
Склеилась от пота
Ври

Каждый без ума
От самого себя
Липкая рука
Крутит грязный кусок
Стали

Бромная вода
Хромистая сталь
Железы-глаза 
Тратишь понапрасну

Стальной
Стальной
Стальной
Стань мной`,
        duration: 3.32,
      },
      {
        id: 4,
        title: "Падение кита",
        content: `
Знак твой сон
Знак во взгляде
В пеший путь
Долгий стадий

Пьют из ран
Кровь москиты
В рот обол
Глаз закрытый

Я проснусь
Обожая каждый день
Я, заснув,
Умираю каждый день

Белый шум
Клюв беззубый
Воздух в пресс
Воздух в губы

Рай для всех
Хотя не для всех
Боль для всех
Поднять меня на смех

Я проснусь
Обожая каждый день
Я, заснув,
Умираю каждый день

Знак твой сон
Знак во взгляде
В пеший путь
Долгий стадий

Пьют из ран
Кровь москиты
В рот обол
Глаз закрытый

Я проснусь
Обожая каждый день
Я, заснув,
Умираю каждый день`,
        duration: 1.59,
      },
    ],
  },
];

const _23 = [
  {
    nameGroup: "Смоляное чучелко",
    nameAlbum: "23",
    get fullName() {
      // геттер
      return `${this.nameGroup} — ${this.nameAlbum}`;
    },
    release: [
      {
        date: "2022-01-23",
        UPC: "198003011083/198002899538",
        photographer: "Hans Jacob Haarseth",
        photographerURL: "https://www.instagram.com/vedonas/",
        design: "Дизайн",
        designer: "Ярослав Жук",
      },
    ],
    buttons: [
      {
        itunes:
          "https://music.apple.com/ru/album/23-single/1604100999?at=1000lqjf&ct=bq&uo=4&app=itunes&Is=1&ls=1",
        bandcamp: "https://smolyanoechuchelko.bandcamp.com/album/23",
        amazon: "https://music.amazon.com/albums/B09PQ7VV7D?tag=bandlnk-20",
        apple:
          "https://music.apple.com/ru/album/23-single/1604100999?at=1000lqjf&ct=bq&uo=4&app=music&Is=1&ls=1",
        vk: "https://vk.com/music/album/-2000261714_14261714_fd2045122e6407c160",
        youtube:
          "https://music.youtube.com/playlist?list=OLAK5uy_kyipWPjQMZME10sEGO804LM9X_kfBdT28",
        spotify: "https://open.spotify.com/album/64UnYHDHDTSsfNyKSNSHHG",
        yandex: "https://music.yandex.ru/album/20403610",
        deezer: "https://www.deezer.com/ru/album/285303392",
        tidal: "https://listen.tidal.com/album/211242116",
      },
    ],
    detales: [
      {
        id: 0,
        title: "Жанр",
        content: ["Гранж, альтернативный рок."],
      },
      {
        id: 1,
        title: "Запись",
        content: [
          "28/09/2021 (Музыкальная Академия Матвиенко М.А.М.А, Москва).",
          "01/11/2021 (DTH Studios, Москва).",
        ],
      },
      {
        id: 2,
        title: "Сведение",
        content: [
          '16/11/2021 и 17/11/2021 (Студия звукозаписи "Винтаж Рекордс", Москва).',
        ],
      },
      {
        id: 3,
        title: "Мастеринг",
        content: [
          "30 ноября 2021—04 декабря 2022 (Chicago Mastering Service, Chicago, USA).",
        ],
      },
      {
        id: 4,
        title: "Исполнители",
        content: [
          "Ярослав Жук — гитара, вокал, бэк-вокал, слова и музыка.",
          "Никита Минеев — бас-гитара.",
          "Олег Ингиозов — барабаны.",
        ],
      },
      {
        id: 5,
        title: "Продюсирование",
        content: [
          "Ярослав Жук — продюсер.",
          "Илья Marvel Горохводатский — запись/сведение.",
          "Mettew J Barnhart — мастеринг. ",
        ],
      },
    ],
    tracks: [
      {
        id: 0,
        title: "Фиджийская русалка Барнума",
        content: `
Фанзины, флаеры
Отбитый стафф
В фаворе каперы
И DIY
    
Дави на край
Дави на край
Жир, соль глотай
Грязный лоу-фай

Грязный лоу-фай
Кукла в платье бэби-долл
Грязный лоу-фай
Кукла в платье бэби-долл

Протухший бабл-гам
Коммодити 
Чумные доктора
Копром кишки

Дави на край
Дави на край
Жир, соль глотай
Грязный лоу-фай

Грязный лоу-фай
Кукла в платье бэби-долл
Грязный лоу-фай
Кукла в платье бэби-долл

Фанзины, флаеры
Отбитый стафф
В фаворе каперы
И DIY

Дави на край
Дави на край
Жир, соль глотай
Грязный лоу-фай

Грязный лоу-фай
Кукла в платье бэби-долл
Грязный лоу-фай
Кукла в платье бэби-долл`,
        duration: 3.28,
      },

      {
        id: 1,
        title: "Слипер",
        content: `
Бутафорный дайс
Чёрно-белый дайс
Бутафорный, бутафорный

Хайвей
На дисплей
Вбей мне кляп
Всунь в слип страп
Хайвей
На дисплей
Вбей мне кляп
Всунь в слип страп

Бара-манга net
Мёртвых хикки след
Бара-манга, бара-манга

Хайвей
На дисплей
Вбей мне кляп
Всунь в слип страп
Хайвей
На дисплей
Вбей мне кляп
Всунь в слип страп

Бутафорный дайс
Чёрно-белый дайс
Бутафорный, бутафорный

Хайвей
На дисплей
Вбей мне кляп
Всунь в слип страп
Хайвей
На дисплей
Вбей мне кляп
Всунь в слип страп`,
        duration: 3,
      },
      {
        id: 2,
        title: "Швайс",
        content: `
Знаю, у тебя
Нет хорошей мечты
Знаю, у тебя
Нет хорошей мечты
Знаю, у тебя
Нет хорошей мечты
Знаю, что тебя нет
	
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
	
Слишком глуп
Для вмороженных в лёд
Слишком глуп
Для вмороженных в лёд
Слишком глуп
Для вмороженных в лёд
Слишком глуп для

Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс

Знаю, у тебя
Нет хорошей мечты
Знаю, у тебя
Нет хорошей мечты
Знаю, у тебя
Нет хорошей мечты
Стыд и злость,
В ушах нарастающий гул

Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
Швайс
	
День удался
Чудесный день`,
        duration: 2.58,
      },
    ],
  },
];

//  оператор расширения или распространения (spread-оператор)
export const ALBUMSDATA = [..._23, ...EP];

// деструктуризация
export function buttons(nameAlbum: string) {
  const { buttons } = ALBUMSDATA.filter((_) => _.nameAlbum === nameAlbum)[0];
  return buttons[0];
}

export function release(nameAlbum: string) {
  const { release } = ALBUMSDATA.filter((_) => _.nameAlbum === nameAlbum)[0];
  return release[0];
}

export function detales(nameAlbum: string) {
  const { detales } = ALBUMSDATA.filter((_) => _.nameAlbum === nameAlbum)[0];
  return detales;
}

export function tracks(nameAlbum: string) {
  const { tracks } = ALBUMSDATA.filter((_) => _.nameAlbum == nameAlbum)[0];
  return tracks;
}

// console.log(JSON.stringify(_23));
